app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "another comment."], ["created_at", Sat, 11 Jan 2014 21:23:15 UTC +00:00], ["post_id", 5], ["updated_at", Sat, 11 Jan 2014 21:23:15 UTC +00:00], ["user_id", 1]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.build(params.require(:comment).permit(:body))
		@comment.creator = User.first #TODO Fix after authentication.

		if @comment.save