app/controllers/posts_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
  	@post = Post.new(post_params)
  	@post.creator = User.first #TODO: change once we have authentication

  	if @post.save

UPDATE "posts" SET "title" = ?, "url" = ?, "updated_at" = ? WHERE "posts"."id" = 5  [["title", "updated title"], ["url", "url"], ["updated_at", Sat, 11 Jan 2014 20:40:29 UTC +00:00]]
---
  def update
  	if @post.update(post_params)